import { CommentProps } from '@/components/modules/viewItem/CommentSection';

export const commentsBlockData: CommentProps[] = [
  {
    username: 'Констянтин Петрович',
    comment:
      'Вітання. Добро пожалувати в систему перекладів «UA Translate». Цей сайт призначений для професійних мов любительських перекладів будь-яких новелів, фанфіків, ранобе з різних мов. Ваші улюблені ранобе, новели та інше на українській мові!',
    avatar: null,
    publicationData: '5 годин тому',
  },
  {
    username: 'Констянтин Петрович',
    comment:
      'Вітання. Добро пожалувати в систему перекладів «UA Translate». Цей сайт призначений для професійних мов любительських перекладів будь-яких новелів, фанфіків, ранобе з різних мов. Ваші улюблені ранобе, новели та інше на українській мові!',
    avatar: null,
    publicationData: '5 годин тому',
  },
  {
    username: 'Констянтин Петрович',
    comment:
      'Вітання. Добро пожалувати в систему перекладів «UA Translate». Цей сайт призначений для професійних мов любительських перекладів будь-яких новелів, фанфіків, ранобе з різних мов. Ваші улюблені ранобе, новели та інше на українській мові!',
    avatar: null,
    publicationData: '5 годин тому',
  },
  {
    username: 'Констянтин Петрович',
    comment:
      'Вітання. Добро пожалувати в систему перекладів «UA Translate». Цей сайт призначений для професійних мов любительських перекладів будь-яких новелів, фанфіків, ранобе з різних мов. Ваші улюблені ранобе, новели та інше на українській мові!',
    avatar: null,
    publicationData: '5 годин тому',
  },
];
