import clsx from 'clsx';
import Link from 'next/link';
import React from 'react';

import s from './TextSection.module.scss';

type Props = {};

const TextSection = (props: Props) => {
  return (
    <section className={clsx(s.section, 'section')}>
      <div className="container">
        <div className={s.wrapper}>
          <div className={s.text}>
            <h2>Вітаємо!</h2>
            <p>
              Ласкаво просимо в систему перекладів «UA Translate». Цей сайт призначений для
              професійних та любительських перекладів будь-яких новел, фанфіків, ранобе з різних
              мов, а також публікацій авторських творів. Ваші улюблені ранобе, новели та багато
              іншого на українській мові!
            </p>
            <h2>Як це все відбувається?</h2>
            <p>
              До ваших послуг: коментування перекладів та їх фрагментів, різноманітна статистика.
              Також ви можете оцінювати як саму роботу, так і якість перекладу. При бажанні ви
              можете купити у перекладача/автора розділи за які встановлення ціна, тим самим
              допомагаючи та мотивуючи автора/перекладача.
            </p>
            <h2>
              Хочете бути перекладачем? Заробіть на перекладі улюбленого твору! Як це працює? все
              Просто!
            </h2>

            <p>
              Після реєстрації, подаєте заявку на схвалення перекладу (Кнопка: Створити переклад).
              Після схвалення модератором публікуєте розділи перекладу, зробленого вами з іншої
              мови.
            </p>
            <p>
              Перекладач створює переклад, публікує, та встановлює розділи або публічного доступу,
              або платними, доступними за підпискою, які можуть придбати нетерплячі користувачі!
              Перекладач може сам встановити ціну на кожен проект (або взагалі виставити
              безкоштовно), що перекладається. Це гарна мотивація для перекладача, а також швидкий
              переклад для читачів! Звичайно платно робити не обов’язково, це все на ваш вибір!
            </p>
            <h2>не можете розібратися?</h2>
            <p>
              <Link href="/faq">FAQ</Link>
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default TextSection;
